/**
 * Created by hxsd on 2016/5/18.
 */
//城市数组
var arr = [];
arr["北京"] = ["北京"];
arr["河南"] = ["开封", "洛阳", "平顶山", "焦作", "鹤壁", "新乡", "安阳", "濮阳", "许昌", "漯河", "三门峡", "南阳", "商丘", "周口", "驻马店", "信阳", "济源", "郑州"];
arr["云南"] = ["昆明", "玉溪", "邵通", "普洱", "临沧", "保山", "丽江"];
arr["辽宁"] = ["沈阳", "鞍山", "抚顺", "本溪","朝阳", "丹东", "锦州", "葫芦岛", "营口", "盘锦", "阜新", "辽阳", "铁岭", "海城"];
arr["黑龙江"] = ["哈尔滨", "齐齐哈尔", "鹤岗", "双鸭山", "鸡西", "大庆", "伊春", "牡丹江", "佳木斯", "七台河", "黑河", "绥化", "大兴安岭", "铁力", "北安"];
arr["湖南"] = ["长沙", "株洲", "湘潭", "韶山", "衡阳", "岳阳", "常德", "张家界", "郴州", "益阳", "永州", "怀化", "娄底", "耒阳"];
arr["安徽"] = ["铜陵", "合肥", "淮南", "淮北", "芜湖", "蚌埠", "马鞍山", "当涂", "安庆", "黄山", "滁州", "阜阳", "毫州", "宿州", "池州", "六安", "宣城", "凤阳"];
arr["山东"] = ["济南", "淄博", "枣庄", "东营", "潍坊", "烟台", "威海", "莱芜", "德州", "临沂", "聊城", "滨州", "菏泽", "日照", "泰安", "济宁", "青岛"];
arr["新疆"] = ["乌鲁木齐", "克拉玛依", "石河子", "吐鲁番", "哈密", "和田", "阿克苏", "喀什"];
arr["江苏"] = ["南京", "无锡", "徐州", "常州", "苏州", "南通", "连云港", "淮安", "盐城", "扬州", "镇江", "泰州", "宿迁"];
arr["浙江"] = ["杭州", "宁波", "温州", "嘉兴", "湖州", "绍兴", "金华", "衢州", "舟山", "台州", "丽水"];
arr["江西"] = ["南昌", "景德镇", "萍乡", "九江", "新余", "鹰潭", "赣州", "吉安", "宜春", "抚州", "上饶"];
arr["湖北"] = ["武汉", "黄石", "十堰", "宜昌", "襄樊", "荆门", "孝感", "荆州", "黄冈", "咸宁", "随州"];
arr["广西"] = ["南宁", "柳州", "桂林", "梧州", "北海", "防城巷", "钦州", "贵港", "玉林", "百色", "贺州", "河池", "南宁", "柳州"];
arr["甘肃"] = ["兰州", "嘉峪关", "金昌", "白银", "天水", "武威", "张掖", "平凉", "酒泉", "庆阳", "定西", "陇南", "临夏"];
arr["山西"] = ["太原", "大同", "阳泉", "晋城", "朔州", "晋中", "忻州", "吕梁", "临汾", "运城", "长治"];
arr["内蒙古"] = ["呼和浩特", "包头", "乌海", "赤峰", "呼伦贝尔", "鄂尔多斯", "巴彦淖尔", "通辽"];
arr["陕西"] = ["西安", "铜川", "宝鸡", "咸阳", "渭南", "延安", "汉中", "榆林", "商洛", "安康"];
arr["吉林"] = ["长春", "吉林", "四平", "通化", "白山", "松原", "白城", "公主岭", "辽源", "珲春"];
arr["福建"] = ["福州", "厦门", "三明", "莆田", "泉州", "漳州", "南平", "龙岩", "宁德"];
arr["贵州"] = ["贵阳", "六盆水", "遵义", "铜仁", "毕节", "安顺", "黔西"];
arr["广东"] = ["广州", "珠海", "汕头", "韶关", "河源", "梅州", "惠州", "汕尾", "东莞", "中山", "江门", "佛山", "阳江", "湛江", "茂名", "肇庆", "云浮",
    "清远", "潮州", "揭阳"];
arr["西藏"] = ["拉萨", "那曲", "山南", "昌都", "日喀则", "阿里", "林芝"];
arr["四川"] = ["成都", "自贡", "攀枝花", "泸州", "绵阳", "德阳", "广元", "遂宁", "内江", "乐山", "宜宾", "广安", "南充", "达州", "巴中", "雅安", "眉山", "资阳"];
arr["宁夏"] = ["银川", "石嘴山", "吴忠", "固原", "中卫"];
arr["海南"] = ["海口", "三亚", "琼海", "万宁", "东方", "文昌", "五指山", "临高", "安定", "屯昌", "昌江", "白沙", "琼中", "黎水", "保亭", "乐东"];
arr["其他"] = ["台北", "香港", "澳门"];
/**
 * 省市联动
 */
var $province, $city;

function choseCity() {
    $province = $("#province");
    $city = $("#city");
    for (var i in arr) {
        var $optionProvince = $("<option value='" + i + "'>" + i + "</option>");
        $province.append($optionProvince);
    }
    $province.change(function () {
        var province = $(this).val();
        $city.children("option:not(:first)").remove();
        for (var i in arr[province]) {
            var $optionCity = $("<option value='" + arr[province][i] + "'>" + arr[province][i] + "</option>");
            $city.append($optionCity);
        }
    })
}